//#include <stdio.h>
//
////只要参与表达式运算就会发生整型提升
//
//int main() {
//
//	char a = 3;
//	//00000000000000000000000000000011
//	//因为a是char类型,所以要对整型进行截取，从低位开始截取
//	//00000011 --a
//
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 --b
//
//	//a和b如何相加
//	//00000011
//	//01111111
//	//当要进行加号运算时，要先进行整型提升
//	//整型提升是按照变量的数据类型的符号为来提升的
//	//这里的char类型是有符号位的，所以按符号位提升
//	char c = a + b;
//	//a,b提升整型后为：
//	//00000000000000000000000000000011	--a
//	//00000000000000000000000001111111	--b
//	//相加后：
//	//00000000000000000000000010000010
//	//加完后又要将结果放回char中，所以又要进行截取
//	//10000010   --截取后的值
//	//但是我们要输出的是整型%d
//	//所以又要整型提升为
//	//11111111111111111111111110000010	--补码
//	//11111111111111111111111110000001	--反码
//	//10000000000000000000000001111110	--原码	--（-126）
//	printf("%d\n", c);
//	//所以最终打印出来的值为-126
//
//	char a1 = 0xb6;
//	short b1 = 0xb600;
//	int c1 = 0xb6000000;
//	if (a1 == 0xb6) {
//		printf("a");
//	}
//	if (b1 == 0xb600) {
//		printf("b");
//	}
//	if (c1 == 0xb6000000) {
//		printf("c\n");
//	}
//	//结果只会打印c,因为进行==运算的时候会进行整型提升，只有int类型才会和0xb6000000相等
//
//
//	char c2 = 1;
//	printf("%u\n", sizeof(c));	//1
//	printf("%u\n", sizeof(+c));	//4
//	printf("%u\n", sizeof(-c));	//4
//	printf("%u\n", sizeof(!c));	//1
//
//
//
//	getchar();
//	return 0;
//}