//#include <stdio.h>
//
////转义字符
////左移和右移运算符
////位操作
//
//
//
//int main() {
//
//	//这里打印的并不是我们想要的结果
//	// \t是水平制表符
//	//printf("c:\test\32\test.c");
//	//这里才是我们想要的结果
//	//printf("c:\\test\\32\\test.c\n");
//
//	//printf("%c\n",''');  //报错
//	//printf("%c\n", '\'');
//
//	//\32是一个字符，32是2个8进制数字
//	//32作为8进制代表的那个十进制数字，作为ASCII码值，对应的字符
//	//32 --> 10进制 26 --> 作为ASCII码值代表的字符
//	//printf("%d\n", strlen("C:\test\32\test.c"));  //13
//	printf("%c\n", '\101');
//	printf("%c\n", '\x61');
//
//	
//	//移（2进制）位运算符
//	//<<左移
//	//>>右移
//	//int a = 1;
//	//整数1占4个字节 - 32bit位
//	//0000000000 0000000000 0000000000 01
//	//int b = a << 1;
//	//printf("%d\n", b);  //b = 2  0000000000 0000000000 0000000000 10  说明左移了一位
//
//	//int c = a << 2;
//	//printf("%d\n", c);  //c = 4  0000000000 0000000000 0000000001 00  说明左移了两位
//
//	//printf("%d\n", a);  //a = 1 a的值是不会变的
//
//	//int a1 = 10;
//	//将a1的值转换成二进制数，然后右移2位再计算出十进制数后，输出结果
//	//10 -- 1010  右移两位后 --0010  = 2
//	//int b1 = a1 >> 2;
//	//printf("%d\n", b1);
//
//
//	//（2进制）位操作
//	//& 按位与
//	//| 按位或
//	//^ 按位异或  异为1，同为0
//
//	//int num1 = 3;   //011
//	//int num2 = 5;   //101
//	//int num3 = num1 & 9;
//	//int num4 = -11;       //C语言中一切非0的值都是真
//
//	//printf("%d\n", num1 & num2);    //001  = 1
//	//printf("%d\n", num1 | num2);    //111  = 7
//	//printf("%d\n", num1 ^ num2);    //110  = 6
//	//printf("%d\n", num3);
//	//printf("%d\n", !num4);
//
//
//
//
//
//
//
//
//	getchar();
//	return 0;
//}