//#include <stdio.h>
//
//int main() {
//
//	//int a = 0x11223344;
//	//char* pc = &a;
//	//int* pa = &a;
//
//	//printf("%p\n", pc);
//	//printf("%p\n", pc + 1);
//	//
//	//printf("%p\n", pa);
//	//printf("%p\n", pa + 1);
//	//printf("%p\n", pa - 1);
//
//	//指针类型决定了：指针走一步走多远（指正的步长）
//	//char *p;   p+1 -->1
//	//int *p;    p+1  -->4
//	//double *p; p+1  --8
//
//	//int arr[10] = { 0 };
//	//int* p = arr;  //数组名--首元素地址
//	//01 00 00 00		arr[0] = 00000001 = 1  内存读取是从右往左读取的
//	//01 00 00 00		arr[1] = 00000001 = 1
//	//01 00 00 00		arr[2] = 00000001 = 1
//	//01 00 00 00		arr[3] = 00000001 = 1
//	//01 00 00 00		arr[4] = 00000001 = 1
//	//01 00 00 00		arr[5] = 00000001 = 1
//	//01 00 00 00		arr[6] = 00000001 = 1
//	//01 00 00 00		arr[7] = 00000001 = 1
//	//01 00 00 00		arr[8] = 00000001 = 1
//	//01 00 00 00		arr[9] = 00000001 = 1
//	//因为是以10进制输出所以数组输出10个元素为 1 1 1 1 1 1 1 1 1 1
//	//char* p = arr;
//	//char类型的话，内存是这样存放的
//	//01 01 01 01		arr[0] = 01010101 = 16843009  内存读取是从右往左读取的
//	//01 01 01 01		arr[1] = 01010101 = 16843009
//	//01 01 00 00		arr[2] = 00000101 = 257       下面都是0
//	//00 00 00 00
//	//00 00 00 00
//	//00 00 00 00
//	//00 00 00 00
//	//00 00 00 00
//	//00 00 00 00
//	//00 00 00 00
//	//因为是以10进制输出所以数组输出10个元素为 16843009 16843009 257 0 0 0 0 0 0 0
//	//for (int i = 0; i < 10; i++) {
//	//	*(p+i) = 1;
//	//}
//	//for (int i = 0; i < 10; i++) {
//	//	printf("%d\n", arr[i]);
//	//}
//
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//int* p = arr;
//	//int len = sizeof(arr) / sizeof(arr[0]);
//	//for (int i = 0; i < len; i++) {
//	//	//注意这里不能用前置++,会让指针越界，成为野指针
//	//	//用后置++
//	//	//printf("%d\n", *(++p));
//	//	printf("%d\n", *(p++));
//	//}
//
//	//指针-指针
//	//得到的我们数组中间元素的个数
//	char ch[5] = { 0 };
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n", &arr[9] - &arr[0]);		//输出为9
//	printf("%d\n", &arr[0] - &arr[9]);		//输出为-9
//	//要想得到数组元素中间个数，得用大的地址-小地址。而且得用同一个空间里面的
//	//error,结果是不可预知的，错误写法
//	//printf("%d\n", &arr[9] - &ch[0]);		//注意这里千万不可这么写，因为两个地址不在同一个空间内。不知道会出现啥结果
//	
//
//
//	getchar();
//	return 0;
//}