//#include <stdio.h>
//
////通过指针可以访问到数组里面的元素
//
//
//int main() {
//
//	//int arr[10] = { 0 };
//	//printf("%p\n", arr);	//数组首元素的地址
//	//printf("%p\n", arr+1);
//	//printf("%p\n", &arr[0]);
//	//printf("%p\n", &arr[0]+1);
//	//printf("%p\n", &arr);
//	//printf("%p\n", &arr+1);
//
//	//1、&arr - &数组名不是首元素的地址-数组名表示整个数组 -- &数组名 取出的是整个数组的地址
//	//2、sizeof(数组名)  -- 数组名表示的是整个数组 -- sizeof(数组名)计算的是整个数组的大小
//
//	int arr[10] = { 0 };
//	int* p = arr;
//	for (int i = 0; i < 10; i++) {
//		//注意这里不要用p++，会导致后面的指针有影响，p++相当于将p的本身指向改变了，如果下面在用p的话,就不是在arr数组的首元素地址了
//		//用p+1，就不会改变p的大小，后面要用到p的话，P还是指向的是数组的首元素地址位置
//		//*(p++) = i;
//		*(p+1) = i;
//	}
//	for (int i = 0; i < 10; i++) {
//		//printf("%d\n", arr[i]);
//		printf("%d\n", *(p+i));
//	}
//
//
//
//	getchar();
//	return 0;
//}