#include <stdio.h>
//#include <float.h>
//#include <limits.h>

int main() {

	//double d = 1E10;
	//printf("%lf\n", d);

	//unsigned short a = -3;
	//printf("%u\n", a);
	
	//char a = 123;
	//float a = 5.2226;
	//int b = (int)a;
	//printf("%f\n", a);
	//printf("%d\n", b);



	int n = 9;
	//00000000 00000000 00000000 00001001	--补码
	//0 00000000 00000000000000000001001
	//S    E             M
	//E全为0时M前面直接补0，E = 1-127 = 126;	取出后，浮点数表达的是：
	//(-1)^0*0.00000000000000000001001*2^-126
	//浮点只打印后6位小数，所以打印0.000000
	float* pf = (float*)&n;
	printf("%d\n", n);
	printf("%f\n", *pf);

	*pf = 9.0;
	//以浮点数的形式存储的话
	//1001.0
	//1.001*2^3
	//(-1)^0 * 1.001 * 2^3
	//E = 3,加上127得130   130转二进制得10000010
	//M补全23位
	//0 10000010 00100000000000000000000
	//然后站在n的角度上看，01000001000100000000000000000000  -->  1091567616
	printf("%d\n", n);
	printf("%f\n", *pf);//9.000000

	//通过以上案例可以得出
	//浮点数的方式放内存和整型数据放内存的方式不一样，取出来的方式也不一样
	//整型形式放内存，以浮点形式取出，结果就不是我们想要的，浮点就应该按浮点存，浮点取
	//浮点形式放内存，以整型形式取出，结果也不是我们想要的，整型就应该按整型存，整型取


	getchar();
	return 0;
}