//#include <stdio.h>
//
//
//int main() {
//
//	////int* p = NULL;	//p是整型指针	-->指向整型的指针		//可以存放整型的地址
//	//char* pc = NULL;	//pc是字符指针	-->指向字符的指针		//可以存放字符的地址
//	//					//数组指针		-- 指向的是数组		//可以存放数组的地址
//
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//int (*p)[10] = &arr;	//数组的地址要存起来
//	//						//上面的p就是数组指针
//	//int i = 0;
//	////for (i = 0; i < 10; i++) {
//	////	printf("%d ", (*p)[i]);
//	////}
//	//for (i = 0; i < 10; i++) {
//	//	printf("%d ", *(*p + i));
//	//}
//
//	//char* arr2[5];				//指针数组里面存放的是char*类型的元素
//	//char* (*pa)[5] = &arr2;		//数组指针指向的是一个里面存放char*类型元素的数组
//
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//int* p = arr;
//	//int i = 0;
//	//for (i = 0; i < 10; i++) {
//	//	printf("%d ", *(p + i));
//	//}
//	//int(*pa)[10] = &arr;
//	//int i = 0;
//	//for (i = 0; i < 10; i++) {
//	//	printf("%d ", *(*pa + i));
//	//}
//
//
//	getchar();
//	return 0;
//}