//#include <stdio.h>
//
////一般情况下，数组指针用在二维数组及以上
////总结下来
////访问数组元素共有4种写法		--一般记住传统写法和指针写法，然后数组名和指针名可以互换即可
////传统写法		-->		数组名[]
////伪传统写法		-->		指针名[]
////指针写法		-->		*(指针+下标)
////伪指针写法		-->		*(数组名+下标)
//
//
//void print1(int arr[3][5], int x, int y) {
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < x; i++) {
//		for (j = 0; j < y; j++) {
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}
//
////方法二
////因为实参传过来的是二维数组首元素地址-->第一行数组地址
////第一行数组地址是一个一维数组，所以用一个数组指针来接收
//print2(int (*parr)[5], int x, int y) {
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < x; i++) {
//		for (j = 0; j < y; j++) {
//			//传统写法
//			//printf("%d ", parr[i][j]);
//			//伪传统写法
//			//printf("%d ", (*(parr+i))[j]);
//			//指针写法
//			//printf("%d ", *(*(parr+i))+j);
//			//伪指针写法
//			printf("%d ", *(parr[i]+j));
//		}
//		printf("\n");
//	}
//}
//
//
//
//int main() {
//
//	int iarr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = iarr;
//	int i = 0;
//	for (i = 0; i < 10; i++) {
//		//总共有4种写法
//		
//		////传统写法
//		//printf("%d ", iarr[i]);
//		////数组名换指针写法	--伪传统写法
//		//printf("%d ", p[i]);
//		////指针写法
//		//printf("%d ", *(p + i));
//		////指针换数组名写法	--伪指针写法
//		//printf("%d ", *(iarr + i));
//	}
//
//	printf("\n");
//
//
//
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	//print1(arr,3,5);	//arr  --  数组名  --  数组名就是首元素地址
//	//注意这里是二维数组，当传参的时候，我们需要把二维数组想象成一维数组
//	//即，数组名-->首元素地址-->是二维数组的第一行地址
//
//	//所以可以写成另外一种方式访问数组中的每个元素
//	print2(arr, 3, 5);
//
//
//	getchar();
//	return 0;
//}