//#include <stdio.h>
//
//int main() {
//
//	//char ret = sizeof('w');
//	//char va = 97;
//	//printf("%d\n", sizeof(ret));		//--1
//
//	////这里是视*a是一个字符，所以打印的是1个字节
//	//char arr[] = { 'q','w','s' };
//	//printf("%d\n", sizeof(*arr));			//--1
//
//	////这里是视'a' = 97，所以打印的是4个字节
//	//printf("%d\n", sizeof('a'));		//--4
//
//
//
//	//数组名是首元素的地址
//	//唯独下面两种情况不是：
//	//1、sizeof(数组名)	--  数组名表示整个数组
//	//2、&数组名  --  数组名表示整个数组 -- 取出的是整个数组的地址
//	//其他情况数组名都是首元素地址
//	
//	//一维数组	--整型数组
//	int a[] = { 1,2,3,4 };//4*4 = 16
//	printf("%d\n", sizeof(a));			//16	sizeof(数组名)--计算的是整个数组大小-单位是字节
//	printf("%d\n", sizeof(a + 0));		//4/8	数组名这里表示首元素的地址，a+1还是首元素地址，地址大小就是4/8个字节
//	printf("%d\n", sizeof(*a));			//4/8	数组名是首元素地址，所以解引用就是数组第一个元素，int型数据是占4个字节
//	printf("%d\n", sizeof(a + 1));		//4/8	数组名表示的是首元素地址，a+1表示第二个元素地址，地址的大小就是4/8个字节
//	printf("%d\n", sizeof(a[1]));		//4/8	第二个元素的大小，int类型数据占4个字节
//	printf("%d\n", sizeof(&a));			//4/8	&a取出的是整个数组的地址，但是数组的地址也是地址，是地址就是占4/8个字节
//	printf("%d\n", sizeof(*&a));		//16	&a是数组的地址，数组的地址解引用访问的数组，sizeof计算的就是数组的大小单位是字节
//	printf("%d\n", sizeof(&a + 1));		//4/8	&a是数组的地址，&a+1虽然跳过了整个数组，但是还是一个地址，是地址就是占4/8个字节
//	printf("%d\n", sizeof(&a[0]));		//4/8	&a[0]就是数组第一个元素的地址，占4/8个字节
//	printf("%d\n", sizeof(&a[0] + 1));	//4/8	&a[0]+1就是第二个元素的地址，占4/8个字节
//
//	printf("-------------------------------------\n");
//
//	//字符数组
//	char ch[] = { 'a','b','c','d','e','f' };	//不算'\0'
//
//	printf("%d\n", sizeof(ch));			//6		sizeof(数组名)计算的是数组大小	6*1 = 6
//	printf("%d\n", sizeof(ch + 0));		//4		ch是首元素地址，ch+0还是首元素地址，地址不分贵贱，占4/8个字节
//	printf("%d\n", sizeof(*ch));		//1		*ch解出的是数组第一个元素，char类型的数据占1个字节
//	printf("%d\n", sizeof(ch[1]));		//1		数组第二个元素，1个字节
//	printf("%d\n", sizeof(&ch));		//4		&ch是取出整个数组的地址，地址占4/8个字节
//	printf("%d\n", sizeof(&ch + 1));	//4		&ch是取出整个数组的地址，+1就是跳过整个数组，但是还是一个地址，占4/8个字节
//	printf("%d\n", sizeof(&ch[0] + 1));	//4		&ch[0]取出的是数组第一个元素的地址，+1就是第二个元素的地址，占4/8个字节
//
//	printf("-------------------------------------\n");
//	
//	printf("%d\n", strlen(ch));			//随机值  17
//	printf("%d\n", strlen(ch + 0));		//随机值  17
//	//printf("%d\n", strlen(*ch));		//非法访问 程序崩溃 'a' = 97,把97看成一个地址
//	//printf("%d\n", strlen(ch[1]));	//非法访问 程序崩溃 'b' = 98,把98看成一个地址
//	printf("%d\n", strlen(&ch));		//随机值  17
//	printf("%d\n", strlen(&ch + 1));	//随机值  11 因为跳过了整个数组，从第6个地址开始 差6
//	printf("%d\n", strlen(&ch[0] + 1));	//随机值  16 因为从第二个地址开始	差1
//
//	printf("-------------------------------------\n");
//
//	char ch2[] = "abcdef";				//包括'\0'，其实""字符串就是可以看成一个char类型数组，并且数组末尾存放着'\0'
//	char ch3[] = "";
//	printf("%d\n", sizeof(ch3));		//1，里面有一个'\0'
//	printf("%d\n", sizeof(ch2));		//7，ch2是数组名，sizeof(数组名)求出的是整个数组的大小，这个数组存放了7个元素，所以算出的是7
//	printf("%d\n", sizeof(ch2+0));		//4/8，ch2是数组首元素地址，+0还是首元素地址，占4/8个字节
//	printf("%d\n", sizeof(*ch2));		//1，ch2是首元素地址，*ch2解引用后就是数组第一个元素，char型数据占1个字节
//	printf("%d\n", sizeof(ch2[1]));		//1，ch2[1]是数组第二个元素，所以占1个字节
//	printf("%d\n", sizeof(&ch2));		//4/8，&ch2取的是整个数组的地址，是地址就是占4/8个字节
//	printf("%d\n", sizeof(&ch2+1));		//4/8，&ch2是整个数组的地址，+1后跳过整个数组，但是还是地址，是地址就占4/8个字节
//	printf("%d\n", sizeof(&ch2[0]+1));	//4/8，&ch2[0]取出的是数组第一个元素的地址，+1后是数组第二个元素地址，是地址就占4/8个字节
//
//	printf("-------------------------------------\n");
//
//	printf("%d\n", strlen(ch2));		//6
//	printf("%d\n", strlen(ch2+0));		//6
//	//printf("%d\n", strlen(*ch2));		//非法访问 程序崩溃 *ch2 = 'a' = 97，把97看成一个地址
//	//printf("%d\n", strlen(ch2[1]));	//非法访问 程序崩溃 ch2[1] = 'b' = 98，把98看成一个地址
//	printf("%d\n", strlen(&ch2));		//6，有警告，&ch2是一个数组的地址，应该用数组指针接收，但是strlen(const char*)参数是char*类型，所以不兼容，报警告
//	printf("%d\n", strlen(&ch2+1));		//随机值，&ch2+1直接跳过整个数组的地址，开始往后找字符，找到一个+1，直到找到'\0'
//	printf("%d\n", strlen(&ch2[0]+1));	//5
//
//	printf("-------------------------------------\n");
//
//	char* p = "abcdef";
//	printf("%d\n", sizeof(p));			//4/8，计算指针变量的p的大小
//	printf("%d\n", sizeof(p+1));		//4/8，是一个地址的大小
//	printf("%d\n", sizeof(*p));			//1，*p = 'a'，是一个字符的大小
//	//p是数组的首地址，p[0] == *(p+0)，p[1] == *(p+1) 这样的是完全等价的，p[i]，就是取出i下标的元素
//	printf("%d\n", sizeof(p[0]));		//1，p[0] = 'a'，是一个字符的大小
//	printf("%d\n", sizeof(&p));			//4/8，p是一个指针，&p是取出存放指针的地址，二级指针，只要是指针就占4/8个字节
//	printf("%d\n", sizeof(&p+1));		//4/8，还是一个地址
//	printf("%d\n", sizeof(&p[0]+1));	//4/8，还是一个地址
//
//	printf("-------------------------------------\n");
//
//	printf("%d\n", strlen(p));			//6
//	printf("%d\n", strlen(p+1));		//5
//	//printf("%d\n", strlen(*p));		//非法访问 程序崩溃
//	//printf("%d\n", strlen(p[0]));		//非法访问 程序崩溃
//	printf("%d\n", strlen(&p));			//随机值
//	printf("%d\n", strlen(&p+1));		//随机值
//	printf("%d\n", strlen(&p[0]+1));	//5
//
//
//	getchar();
//	return 0;
//}