//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//#include <string.h>
//
//
//int main() {
//
//	//作业一
//	////在32位小端模式处理器上变量b的值
//	////十六进制，1个数=4个二进制位，1234就是有16位，两个字节
//	////而a又是int类型有4个字节的空间，所以a内存里存储的是 00 00 12 34
//	////小端模式下，低字节放内存的低地址，高字节放内存高地址处
//	////如果是小端模式下，a内存中显示的是 34 12 00 00
//	////大端模式下，低字节放内存的高地址，高字节放内存低地址处
//	////如果是大端模式下，a内存中显示的是 00 00 12 34
//	////&a取出a的地址，将&a强制转化为unsigned char*后，解引用后只能访问一个字节，所以将34存储到b中
//	//unsigned int a = 0x1234;
//	//unsigned char b = *(unsigned char*)&a;
//	////34以十进制输出的话，34转十进制为52
//	//printf("%d\n", b);
//
//
//	//作业二
//	////因为这里是char类型，是有符号的，所以这里char的范围是  -128 ~ 127
//	//char a[1000] = { 0 };
//	//int i = 0;
//	//for (i = 0; i < 1000; i++) {
//	//	a[i] = -1 - i;
//	//	//-1 -2 -3... -128 127 126 .... 3 2 1 0 -1 -2 ....循环一直到1000位
//	//}
//	////而我们strlen读到0就停止
//	////所以看上面，-1~-128有128个，127~1有127个，总共有255个字符，所以输出的是255
//	//printf("%d\n", strlen(a));
//
//
//	//作业三
//	////打印杨辉三角
//	//int arr[10][10] = { 0 };
//	//int i = 0;
//	//int j = 0;
//	//for (i = 0; i < 10; i++) {
//	//	for (j = 0; j < 10; j++) {
//	//		if (j == 0) {
//	//			arr[i][j] = 1;
//	//		}
//	//		if (i == j) {
//	//			arr[i][j] = 1;
//	//		}
//	//		if (i>=2&&j>=1) {
//	//			arr[i][j] = arr[i-1][j] + arr[i-1][j-1];
//	//		}
//	//	}
//	//}
//	//
//	////打印
//	//for (i = 0; i < 10; i++) {
//	//	for (j = 0; j <=i; j++) {
//	//		printf("%d ", arr[i][j]);
//	//	}
//	//	printf("\n");
//	//}
//
//
//	//作业四
//	//猜凶手
//	//题目内容
//	////日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个
//	////以下为4个嫌疑犯的供词：
//	////A说：不是我
//	////B说：是C
//	////C说：是D
//	////D说：C在胡说
//	////已知3个人说了真话，1个人说的是假话
//	////现在请根据这些信息，写一个程序来确定到底凶手是谁
//
//	//int killer = 0;
//	//for (killer = 'a'; killer < 'd'; killer++) {
//	//	if ((killer != 'a') + (killer == 'c') + (killer == 'd') + (killer != 'd') == 3) {
//	//		printf("凶手就是：%c\n", killer);
//	//	}
//	//}
//
//	//作业五(穷举法)
//	////5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//	////A选手说：B第二，我第三；
//	////B选手说：我第二，E第三；
//	////C选手说：我第一，D第二；
//	////D选手说：C最后，我第三；
//	////E选手说：我第四，A第一；
//	////比赛结束后，每位选手都说对了一半，请编程确定比赛名次
//	//int a = 0;
//	//int b = 0;
//	//int c = 0;
//	//int d = 0;
//	//int e = 0;
//	//for (a = 1; a <= 5; a++) {
//	//	for (b = 1; b <= 5; b++) {
//	//		for (c = 1; c <= 5; c++) {
//	//			for (d = 1; d <= 5; d++) {
//	//				for (e = 1; e <= 5; e++) {
//	//					if (((b==2)+(a==3)==1) & 
//	//						((b==2)+(e==4)==1) & 
//	//						((c==1)+(d==2)==1) &
//	//						((c==5)+(d==3)==1) &
//	//						((e==4)+(a==1)==1)) {
//	//						if (a * b * c * d * e==120) {
//	//							printf("a = %d b = %d c = %d d = %d e = %d\n", a, b, c, d, e);
//	//						}
//	//					}
//	//				}
//	//			}
//	//		}
//	//	}
//	//}
//	
//
//
//	getchar();
//	return 0;
//}